### 📋 Terraform Plan — PROD Environment

<details>
<summary>Click to expand plan output</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.key_vault.data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGE2NDk4OS1mMDdkLTRkODMtYTMxNi0yMThlYjQyZDZjNGY7b2JqZWN0SWQ9N2IyMWM3MzYtOWE1NC00OWRiLTk0NTgtYWQxOWMyZTdmYzAxO3N1YnNjcmlwdGlvbklkPTljNzI2YjdkLTYxZDQtNGQ0MS05ZjUyLTY1NjBhZGM4NjNkOTt0ZW5hbnRJZD01ZGJmMWFkZC0yMDJhLTRiOGQtODE1Yi1iZjBmYjAyNGUwMzM=]
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGE2NDk4OS1mMDdkLTRkODMtYTMxNi0yMThlYjQyZDZjNGY7b2JqZWN0SWQ9N2IyMWM3MzYtOWE1NC00OWRiLTk0NTgtYWQxOWMyZTdmYzAxO3N1YnNjcmlwdGlvbklkPTljNzI2YjdkLTYxZDQtNGQ0MS05ZjUyLTY1NjBhZGM4NjNkOTt0ZW5hbnRJZD01ZGJmMWFkZC0yMDJhLTRiOGQtODE1Yi1iZjBmYjAyNGUwMzM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.app_service.azurerm_service_plan.this will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "centralindia"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "asp-medcore-prod-cin"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-medcore-prod-cin"
      + sku_name                        = "B2"
      + tags                            = {
          + "Application" = "MedCore"
          + "CostCenter"  = "IT-001"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Platform Team"
        }
      + worker_count                    = (known after apply)
    }

  # module.key_vault.azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "centralindia"
      + name                          = "kv-medcore-prod-cin"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + rbac_authorization_enabled    = true
      + resource_group_name           = "rg-medcore-prod-cin"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "Application" = "MedCore"
          + "CostCenter"  = "IT-001"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Platform Team"
        }
      + tenant_id                     = "5dbf1add-202a-4b8d-815b-bf0fb024e033"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.key_vault.azurerm_key_vault_secret.sql_admin_password[0] will be created
  + resource "azurerm_key_vault_secret" "sql_admin_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key_vault.azurerm_role_assignment.admin will be created
  + resource "azurerm_role_assignment" "admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7b21c736-9a54-49db-9458-ad19c2e7fc01"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.monitoring.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "centralindia"
      + name                                = "appi-medcore-prod-cin"
      + resource_group_name                 = "rg-medcore-prod-cin"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "Application" = "MedCore"
          + "CostCenter"  = "IT-001"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Platform Team"
        }
      + workspace_id                        = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "centralindia"
      + name                            = "log-medcore-prod-cin"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-medcore-prod-cin"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Application" = "MedCore"
          + "CostCenter"  = "IT-001"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Platform Team"
        }
      + workspace_id                    = (known after apply)
    }

  # module.sql.azurerm_mssql_database.this will be created
  + resource "azurerm_mssql_database" "this" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 100
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-medcore-prod"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "S2"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "Application" = "MedCore"
          + "CostCenter"  = "IT-001"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Platform Team"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = true

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy {
          + backup_interval_in_hours = (known after apply)
          + retention_days           = 35
        }

      + threat_detection_policy (known after apply)
    }

  # module.sql.azurerm_mssql_firewall_rule.allow_azure_services[0] will be created
  + resource "azurerm_mssql_firewall_rule" "allow_azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # module.sql.azurerm_mssql_server.this will be created
  + resource "azurerm_mssql_server" "this" {
      + administrator_login                      = "medcoreadmin"
      + administrator_login_password             = (sensitive value)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "centralindia"
      + minimum_tls_version                      = "1.2"
      + name                                     = "sql-medcore-prod-cin"
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = true
      + resource_group_name                      = "rg-medcore-prod-cin"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "Application" = "MedCore"
          + "CostCenter"  = "IT-001"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Platform Team"
        }
      + version                                  = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = (known after apply)
          + login_username              = "KUMAR, S. GOUTHAM"
          + object_id                   = "0325bbec-c160-4024-8741-826f5255dffd"
          + tenant_id                   = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_insights_connection_string = (sensitive value)
  + key_vault_uri                  = (known after apply)
  + sql_database_name              = "sqldb-medcore-prod"
  + sql_server_fqdn                = (known after apply)

Error: Missing required argument

  with module.app_service.azurerm_linux_web_app.this,
  on ../../modules/app-service/main.tf line 41, in resource "azurerm_linux_web_app" "this":
  41:     health_check_path   = "/health"

"site_config.0.health_check_path": all of
`site_config.0.health_check_eviction_time_in_min,site_config.0.health_check_path`
must be specified
Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.

```

</details>

**Plan exit code:** `failure`
